// Задача 2. Напишите программу, которая на вход принимает два числа 
// и выдаёт, какое число большее, а какое меньшее.

// Console.Write("Введите первое число ");
// int firstNumber = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число ");
// int secondNumber = Convert.ToInt32(Console.ReadLine());

// if (firstNumber > secondNumber)
// {
//     Console.WriteLine("Наибольшее число из них: " + firstNumber);
// }

// if (secondNumber > firstNumber)
// {
//     Console.WriteLine("Наибольшее число из них: " + secondNumber);
// }

// if (firstNumber == secondNumber)
// {Console.WriteLine("Наибольшее число из них: " + secondNumber);
//     Console.WriteLine("Эти числа равны");
// }

//Задача 4. принимает на вход три числа и выдаёт максимальное из этих чисел.

// Console.Write("Введите первое число ");
// int firstNumber = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число ");
// int secondNumber = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число ");
// int thirdNumber = Convert.ToInt32(Console.ReadLine());

// int max = firstNumber;

// if (secondNumber > max)
// {
//     max = secondNumber;
// }

// if (thirdNumber > max)
// {
//     max = thirdNumber;
// }

// Console.WriteLine("Наибольшее число из них: " + max);

